package com.cau.cc.model.entity;

public enum MajorEnum {
    //    연계전공,
//    융합전공,
//    인문대학,
//    사회과학대학,
//    사범대학,
//    자연과학대학,
//    공과대학,
//    창의ICT공과대학,
//    소프트웨어대학,
//    경영경제대학,
//    약학대학,
//    예술대학,
//    의과대학,
//    적십자간호대학,
//    컴퓨터공학과
    간호학과, 건축학부, 경영학부, 경제학부, 공공인재학부, 공연영상창작학부, 광고홍보학과,
    교육학과, 국어국문학과, 국제물류학과, 글로벌예술학부, 기계공학부, 도시계획부동산학과, 디자인학부,
    문헌정보학과, 물리학과, 미디어커뮤니케이션학부, 미술학부, 사회기반시스템공학부, 사회복지학부, 사회학과,
    산업보안학과, 생명과학과, 생명자원공학부, 소프트웨어학부, 수학과, 스포츠과학부, 시스템생명공학과, 식품공학부,
    심리학과, 아시아문화학부, 약학부, 에너지시스템공학부, 역사학과, 영어교육과, 영어영문학과, 유럽문화학부,
    유아교육과, 융합공학부, 융합교양학부, 음악학부, 응용통계학과, 의학부, 전자전기공학부, 전통예술학부, 정치국제학과,
    지식경영학부, 철학과, 첨단소재학과, 체육학과, 컴퓨터예술학부, 화학과, 화학신소재공학부, AI학과
}
